InformationRegisters/НастройкиИнтеграцииBnovo.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиИнтеграцииBnovo</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОплатыКартой</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагружатьОплатыНаличные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагружатьОплатыКарта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазделятьДоговораПоНомерамБроней</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторГостиницы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Гостиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Гостиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиИнтеграцииBnovo/Forms/ПомощникПодключения/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустой() Тогда
		Запись.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		Запись.Покупатель = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Контрагенты.РозничныйПокупатель");
		Запись.УчетнаяЗапись = Новый УникальныйИдентификатор;

		ПроверитьУстановитьВидОплаты();
		ТуристическийНалогСервер.УстановитьГостиницу(Запись.Гостиница, Запись.Организация);
		ДатаНачалаЗагрузки = НачалоМесяца(ОбщегоНазначения.ТекущаяДатаПользователя());
	КонецЕсли; 
	ВыполнитьЗагрузку = Истина;
	
	ЗаполненыДанныеАутентификации
		= ИнтернетПоддержкаПользователей.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();
КонецПроцедуры 
	
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Перем ДлительнаяОперация;
	
	Если ПараметрыЗаписи.Свойство("ОбновитьИнтерфейс") Тогда
		ОбновитьИнтерфейс();
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ДлительнаяОперация", ДлительнаяОперация) Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ВыполнитьМетодСервисаЗавершение = Новый ОписаниеОповещения("ВыполнитьМетодСервисаЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ВыполнитьМетодСервисаЗавершение, ПараметрыОжидания); 
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьОбменСBnovo") Тогда
		УстановитьПривилегированныйРежим(Истина);
		Константы.ИспользоватьОбменСBnovo.Установить(Истина);
		УстановитьПривилегированныйРежим(Ложь);
		
		ПараметрыЗаписи.Вставить("ОбновитьИнтерфейс");
	КонецЕсли; 
	
	ПараметрыМетода = Новый Структура;;
	ПараметрыМетода.Вставить("УчетнаяЗапись", Запись.УчетнаяЗапись);
	ПараметрыМетода.Вставить("APIKey",        APIKey);
	ПараметрыМетода.Вставить("ДатаНачалаЗагрузки", ДатаНачалаЗагрузки);
	
	ДлительнаяОперация = СоздатьОбновитьПодключениеНаСервере(ПараметрыМетода, УникальныйИдентификатор);
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		РезультатВыполнения = ПолучитьИзВременногоХранилища(ДлительнаяОперация.АдресРезультата);
		Если НЕ РезультатВыполнения.Результат Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'При обновлении данных в Bnovo произошла ошибка: %1'"), РезультатВыполнения.СообщениеОбОшибке));
		КонецЕсли;
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		ПараметрыЗаписи.Вставить("ДлительнаяОперация", ДлительнаяОперация);
	Иначе
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'При обновлении данных в Bnovo произошла ошибка'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(КлючПодключения) 
		ИЛИ ЗавершениеРаботы Тогда
		
		Возврат;
	КонецЕсли;
	
	// если настройка не была завершена, 
	// но подключение к СИ было создано - необходимо его удалить
	УдалениеПодключенияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если НЕ ЗначениеЗаполнено(Запись.Организация) 
		ИЛИ НЕ ЗначениеЗаполнено(Запись.Гостиница) Тогда
	
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Запись.Организация);
	Запрос.УстановитьПараметр("Гостиница",   Запись.Гостиница);
	Запрос.УстановитьПараметр("УчетнаяЗапись",   Запись.УчетнаяЗапись);


	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиИнтеграцииBnovo.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.НастройкиИнтеграцииBnovo КАК НастройкиИнтеграцииBnovo
	|ГДЕ
	|	НастройкиИнтеграцииBnovo.Организация = &Организация
	|	И НастройкиИнтеграцииBnovo.Гостиница = &Гостиница
	|	И НастройкиИнтеграцииBnovo.УчетнаяЗапись <> &УчетнаяЗапись";
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Для выбранной гостиницы уже настроена интеграция'"),, "Гостиница","Запись",Отказ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры  

&НаКлиенте
Процедура ДатаНачалаЗагрузкиПриИзменении(Элемент)
	ДатаНачалаЗагрузки = Макс(ДатаНачалаЗагрузки, ДобавитьМесяц(ОбщегоНазначенияКлиент.ДатаСеанса(), -12));
КонецПроцедуры 

&НаКлиенте
Процедура ПарольИПППриИзменении(Элемент)
	
	ИнтернетПоддержкаПользователейКлиент.ПриИзмененииСекретныхДанных(
		Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольИППНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИнтернетПоддержкаПользователейКлиент.ОтобразитьСекретныеДанные(
		ЭтотОбъект,
		Элемент,
		"ПарольИПП");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Далее(Команда)
	Если Элементы.ГруппаШаги.ТекущаяСтраница = Элементы.ГруппаОбщаяИнформация Тогда
		Если Не ЗаполненыДанныеАутентификации Тогда
			Элементы.ГруппаШаги.ТекущаяСтраница = Элементы.ГруппаПодключениеКПорталу; 
		Иначе
			ПодключитьСервисИнтеграции();
		КонецЕсли; 
	ИначеЕсли Элементы.ГруппаШаги.ТекущаяСтраница = Элементы.ГруппаПодключениеКПорталу Тогда
		
		Результат = ИнтернетПоддержкаПользователейКлиентСервер.ПроверитьДанныеАутентификации(
			Новый Структура("Логин, Пароль",
			ЛогинИПП, ПарольИПП));
		
		Если Результат.Отказ Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				Результат.СообщениеОбОшибке,
				,
				Результат.Поле);
			Возврат;
		КонецЕсли;
		
		Отказ = Ложь;
		
		ПроверитьПодключениеКПорталу1СИТС(
			ЛогинИПП,
			ПарольИПП,
			Отказ);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ПодключитьСервисИнтеграции();
	ИначеЕсли Элементы.ГруппаШаги.ТекущаяСтраница = Элементы.ГруппаАвторизация Тогда
		ПодключитьBNovo();
		Элементы.ФормаНазад.Видимость = Истина;
	ИначеЕсли Элементы.ГруппаШаги.ТекущаяСтраница = Элементы.ГруппаНастройки Тогда
		
		Элементы.ВидОплатыКартой.Видимость = Запись.ЗагружатьОплатыКарта;
		Элементы.ГруппаШаги.ТекущаяСтраница = Элементы.ГруппаНоменклатура;
		Если ПроверитьЗаполнение() Тогда
			Элементы.ФормаДалее.Заголовок = "Готово";
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаШаги.ТекущаяСтраница = Элементы.ГруппаНоменклатура Тогда
		Запись.ДатаПоследнейЗагрузки = ДатаНачалаЗагрузки;
		Запись.РазделятьДоговораПоНомерамБроней = СоздаватьОтдельныйДоговор = 1;
		
		Записать();
		
		// настройка завершена
		КлючПодключения = Неопределено;
		
		Закрыть(РезультатМастера());
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура Назад(Команда)
	
	Если Элементы.ГруппаШаги.ТекущаяСтраница = Элементы.ГруппаНастройки Тогда
		Элементы.ГруппаШаги.ТекущаяСтраница = Элементы.ГруппаАвторизация;
		Элементы.ФормаНазад.Видимость = Ложь;
	ИначеЕсли Элементы.ГруппаШаги.ТекущаяСтраница = Элементы.ГруппаНоменклатура Тогда
		Элементы.ГруппаШаги.ТекущаяСтраница = Элементы.ГруппаНастройки;
		Элементы.ФормаДалее.Заголовок = "Далее";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Процедура ПроверитьПодключениеКПорталу1СИТС(Логин, Пароль, Отказ)
	
	РезультатПроверки = ИнтернетПоддержкаПользователей.ПроверитьЛогинИПароль(
		Логин,
		Пароль);
	
	Если РезультатПроверки.Результат Тогда
		
		ДанныеАутентификации = Новый Структура;
		ДанныеАутентификации.Вставить("Логин", Логин);
		ДанныеАутентификации.Вставить("Пароль", Пароль);
		
		УстановитьПривилегированныйРежим(Истина);
		ИнтернетПоддержкаПользователей.СохранитьДанныеАутентификации(
			ДанныеАутентификации);
		УстановитьПривилегированныйРежим(Ложь);
	Иначе
		ОбщегоНазначения.СообщитьПользователю(
			РезультатПроверки.СообщениеОбОшибке,
			,
			,
			,
			Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция РезультатМастера()
	Результат = Новый Структура;
	Результат.Вставить("ВыполнитьЗагрузку", ВыполнитьЗагрузку);
	Результат.Вставить("Организация", Запись.Организация);
	Результат.Вставить("Гостиница", Запись.Гостиница);
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	ТуристическийНалогСервер.УстановитьГостиницу(Запись.Гостиница, Запись.Организация);
	ПроверитьУстановитьВидОплаты();
КонецПроцедуры

&НаСервере
Процедура ПроверитьУстановитьВидОплаты()
	Если Запись.Организация.Пустая() Тогда
		Запись.ВидОплатыКартой = Неопределено;
		Возврат;
	КонецЕсли;
	
	СведенияОВидахОплат = Справочники.ВидыОплатОрганизаций.ВидыОплатПлатежнойКартой(Запись.Организация);
	Запись.ВидОплатыКартой = СведенияОВидахОплат.ВидОплатыПоУмолчанию;
КонецПроцедуры

&НаСервере
Процедура УдалениеПодключенияНаСервере()
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыПроцедуры = ИнтеграцияBnovoСИКлиентСервер.НовыеПараметрыУдалитьПодключение();
	ПараметрыПроцедуры.КлючПодключения = КлючПодключения;
	ПараметрыПроцедуры.ЭтоТекущийКлючПодключения = Истина;
	
	ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "ИнтеграцияBnovo.УдалитьПодключение", ПараметрыПроцедуры);
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьBNovo()
	ПараметрыМетода = Новый Структура;; 
	
	// уникальный идентификатор подключения, по нему, вместо APIKey мы будем потом общаться с СИ
	ПараметрыМетода.Вставить("УчетнаяЗапись", Запись.УчетнаяЗапись);
	// секретный ключ из подключения к сервису, в программе не хранится, используется только для установки нового подкючения
	ПараметрыМетода.Вставить("APIKey",        APIKey);
	// дата начала первой загрузки, будет уточнена на последненем этапе настройки
	ПараметрыМетода.Вставить("ДатаНачалаЗагрузки",    ДатаНачалаЗагрузки);
	
	// создаем новое подключение по APIKey, если ключ невалидный - метод выдаст ошибку и на следующий шаг мы не продвинемся
	ВыполнитьМетодСервисИнтеграции(СоздатьОбновитьПодключениеНаСервере(ПараметрыМетода, УникальныйИдентификатор), 
		Элементы.ГруппаНастройки , НСтр("ru = 'Подключаем учетную запись BNovo'"));
КонецПроцедуры

#Область РаботаСМетодамиСИ

&НаКлиенте
Процедура ПодключитьСервисИнтеграции()
	// сначала подключимся к СИ, для этого нужна лишь валидная запись на портале 1С:ИТС
	ВыполнитьМетодСервисИнтеграции(ПодключитьСервисИнтеграцииНаСервере(УникальныйИдентификатор), 
		Элементы.ГруппаАвторизация, НСтр("ru = 'Настраиваем сервис интеграции'"));
КонецПроцедуры 

&НаКлиенте
Процедура ВыполнитьМетодСервисИнтеграции(ДлительнаяОперация, СледующийШаг, ЗаголовокФоновогоЗадания)
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = ЗаголовокФоновогоЗадания;
	
	ВыполнитьМетодСервисаЗавершение = Новый ОписаниеОповещения("ВыполнитьМетодСервисаЗавершение", ЭтотОбъект, СледующийШаг);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ВыполнитьМетодСервисаЗавершение, ПараметрыОжидания); 
КонецПроцедуры 

&НаСервереБезКонтекста
Функция СоздатьОбновитьПодключениеНаСервере(ПараметрыМетода, ИдентификаторФормы)
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "ИнтеграцияBnovo.СоздатьОбновитьПодключение", ПараметрыМетода);
КонецФункции

&НаСервереБезКонтекста
Функция ПодключитьСервисИнтеграцииНаСервере(ИдентификаторФормы)
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "ИнтеграцияBnovo.ПодключитьСервисИнтеграции");
КонецФункции

&НаКлиенте
Процедура ВыполнитьМетодСервисаЗавершение(РезультатДлительнойОперации, СледующийШаг) Экспорт
	Если РезультатДлительнойОперации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатДлительнойОперации.Статус <> "Выполнено" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'При выполнении запроса к сервису произошла ошибка. Подробности в журнале регистрации.'"));
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = ПолучитьИзВременногоХранилища(РезультатДлительнойОперации.АдресРезультата);
	Если НЕ РезультатЗапроса.Результат  Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатЗапроса.СообщениеОбОшибке);
		Возврат;
	КонецЕсли;
	
	Если РезультатЗапроса.Свойство("Ответ") Тогда
		Если РезультатЗапроса.Ответ.Свойство("КлючПодключения") Тогда
			// Сохраним ключ текущего подключения, 
			// чтобы удалить его если интеграция не будет завершена
			КлючПодключения = РезультатЗапроса.Ответ.КлючПодключения;
		КонецЕсли;
		Если РезультатЗапроса.Ответ.Свойство("idClient") Тогда
			Запись.ИдентификаторГостиницы = РезультатЗапроса.Ответ.idClient;
		КонецЕсли;
	КонецЕсли;
	
	Если СледующийШаг <> Неопределено Тогда
		Элементы.ГруппаШаги.ТекущаяСтраница = СледующийШаг;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#КонецОбласти
